ar = {
    'welcome_message': """
        🎉 مرحبًا بك في <b>Guidler</b>! 🎉
        🚀 نحن سعداء لثقتك بنا 🥰.
        🙃 بأي حالة تود الانضمام إلينا؟
    """,
    'start_admin_message': """
        🔆 مرحبًا بك في <b>Guidler</b>، أيها المدير! 🔆
        🚀 نحن سعداء لثقتكم بنا 🥰.
    """,
    'start_message': """
        🔆 مرحبًا بك مجددًا في <b>Guidler</b>! 🔆
        🚀 نحن سعداء لثقتك بنا 🥰.
    """,
    'choose_category': """اختر الفئة""",
    'choose_instruction': """اختر التعليمات""",
    'choose_channel_message': """اختر القناة/المجموعة لتعليماتك""",
    'sent_name_category': """<b>أدخل اسم الفئة:</b>""",
    'sent_lang_category': """<b>أدخل لغة الفئة بتنسيق مكون من حرفين (ru, en, إلخ):</b>""",
    'category_crating': """<b>تم إنشاء الفئة بنجاح.</b>""",
    'invalid_language_code': """كود اللغة غير صحيح. يرجى إدخال رمز من حرفين صحيح.""",
    'help_message': """إذًا، إليك قائمة الأوامر:""",
    'registration_required_message': """لكي تستخدم هذه الوظيفة، يجب عليك التسجيل.""",
    'bot_not_admin_message': """
        <b>البوت ليس مديرًا في هذه المحادثة.</b>
        من فضلك، اجعل البوت مديرًا وحاول مرة أخرى.
    """,
    'instruction_added_message': """
        <b>تمت إضافة التعليمات بنجاح.</b>
        - <i>الآن بعد أن قمت بإنشاء التعليمات، يمكنك إنشاء فئات لتصفية المستخدمين.
        - لهذا الغرض، استخدم: /add_category</i>
    """,
    'instruction_already_exists_message': """
        <b>تعليمات بهذا الاسم موجودة بالفعل في هذه القناة.</b>
        <i>يرجى استخدام اسم آخر.</i>
    """,
    'category_creating': """تُنشأ التعليمات. يرجى الانتظار...""",
    'invalid_group_id_message': """تم تقديم معرف المجموعة غير صحيح. الرجاء التحقق والمحاولة مرة أخرى.""",
    'sent_name_instruction': """<b>أرسل اسمًا لتعليماتك.</b>""",
    'bot_not_in_chat_message': """
        <b>البوت لا يمكنه الوصول إلى معلومات عضو الدردشة.</b>
        تأكد من إضافة البوت إلى المجموعة وحاول مرة أخرى.
    """,
    'instruction_added_error': """<b>خطأ في إنشاء التعليمة:</b> هذه موجودة بالفعل.""",
    'inline_chat_selection': """
        تأكيد اختيارك:
        
        - <b>الاسم</b>: {group_name},
        - <b>المعرف</b>: {group_id}
    """,
    'no_rights_in_channel': """لا يمتلك البوت الصلاحيات الكاملة لتعديل الرسائل في المجموعة/القناة المحددة.""",
    'your_channel_name': """اسمك:""",
    'code_404': """لم يتم اجتياز الكابتشا""",
    'code_404_description': """أعد تشغيل الوظيفة دون تغيير الكود المُولد لرؤية نتائجك""",
    'switch_pm_text': """اختر مجموعة/قناة من القائمة أدناه""",
    'channel_approved': """تم تأكيد الاختيار!""",
    'category_name_too_long': """اسم الفئة طويل جدًا! (حتى 20 حرفًا)""",
    'not_instruction_for_faq': """ليس لديك تعليمات يمكن إضافة الأسئلة الشائعة إليها.""",
    'not_categories_for_faq': """ليس لديك فئات يمكن إضافة الأسئلة الشائعة إليها.""",
    'choose_instruction_for_faq': """اختر الإرشاد الذي تريد إضافة الأسئلة الشائعة إليه.""",
    'choose_category_for_faq': """اختر فئة للأسئلة الشائعة.""",
    'enter_faq_name': """
        أدخل اسم الأسئلة الشائعة.
        <i>سيظهر هذا الاسم في المنشور كروابط للتعليمات</i>
    """,
    'enter_faq_content': """أدخل محتوى الأسئلة الشائعة (يمكن أن يكون نصًا أو ملف وسائط).""",
    'faq_added_successfully': """تمت إضافة الأسئلة الشائعة بنجاح.""",
    'back_to_instruction': """العودة إلى التعليمات""",
    'navigation_error': """خطأ في تصفح الصفحات.""",
    'micro_plan_faq': """
        <b>مرحبًا، إليك خطة مصغرة للخطوة الحالية:</b>
        
        1. اختر تعليمات لمنشور الأسئلة الشائعة.
        2. اختر فئة في التعليمات.
        3. أدخل اسمًا لمنشور الأسئلة الشائعة.
        4. أرسل محتوى منشور الأسئلة الشائعة.
        5. سيتم إضافة منشور الأسئلة الشائعة وهو جاهز للنشر.
    """,
    'micro_plan_add_instruction': """
        <b>مرحبًا، إليك خطة مصغرة للخطوة الحالية:</b>
        
        1. اختر أو أضف قناة/مجموعة للبوت.
        2. أضف البوت كمسؤول في القناة/المجموعة المختارة.
        3. أكد اختيارك للقناة/المجموعة في الوضع المضمن.
        4. أدخل اسم التعليمات.
        5. أنهِ العملية. سيتم إرسال إشعار إذا تم إزالة البوت من القناة/المجموعة.
    """,
    'micro_plan_add_category': """
        <b>مرحبًا، إليك خطة مصغرة للخطوة الحالية:</b>
        
        1. أرسل الأمر /add_category لبدء العملية.
        2. اختر التعليمات التي سترتبط بها الفئة.
        3. أدخل اسم الفئة (لا يزيد عن 20 حرفًا).
        4. حدد رمز اللغة المكون من حرفين للفئة (مثل، 'en' أو 'ru').
        5. بعد التحقق وتأكيد المعلومات، ستُضاف الفئة.
    """,
    'not_instruction_for_publish': """<b>لا توجد تعليمات للنشر!</b>""",
    'micro_plan_publish': """
        <b>مرحبًا، إليك خطة مفصلة للخطوة الحالية:</b>
        
        1. اختر تعليمات لمنشور الأسئلة الشائعة.
        2. اختر فئة في التعليمات.
        3. اختر نوع النشر.
        4. بعد الفحص والتأكيد، سيتم نشر تعليماتك. ستتلقى إشعارًا بإتمام العملية.
    """,
    'select_type_for_publish_pro': """
        <b>اختر نوع المنشور</b>
        <i>جميع أنواع المنشورات متاحة لك</i>
    """,
    'select_type_for_publish_not_pro': """
        <b>اختر نوع النشر</b>
        <i>يمكنك نشر صفحة واحدة فقط</i>
    """,
    '': """Please provide the text you want to be translated into Arabic.""",
}
