be = {
    'welcome_message': """
        🎉 Вітаем у <b>Guidler</b>! 🎉
        🚀 Мы рады, што Вы давяраеце нам 🥰.
        🙃 У якім статусе жадаеце далучыцца да нас?
    """,
    'start_admin_message': """
        🔆 Вітаем адміна ў <b>Guidler</b>! 🔆
        🚀 Мы радыя, што Вы давяраеце нам 🥰.
    """,
    'start_message': """
        🔆 З вяртаннем у <b>Guidler</b>! 🔆
        🚀 Мы рады, што Вы давяраеце нам 🥰.
    """,
    'choose_category': """Выберыце катэгорыю""",
    'choose_instruction': """Выберыце інструкцыю""",
    'choose_channel_message': """Выберыце канал/групу для Вашай інструкцыі""",
    'sent_name_category': """Увядзіце назву катэгорыі:""",
    'sent_lang_category': """<b>Увядзіце мову для катэгорыі ў двухлітарным фармаце (ru, en, і г.д.):</b>""",
    'category_crating': """<b>Катэгорыя паспяхова створана.</b>""",
    'invalid_language_code': """Няправільны код мовы. Калі ласка, увядзіце слушны двухлітарны код.""",
    'help_message': """<i>Дык вось спіс каманд:<i>""",
    'registration_required_message': """Для выкарыстання гэтай функцыі неабходна зарэгістравацца.""",
    'bot_not_admin_message': """
        <b>Бот не з'яўляецца адміністратарам у гэтым чаце.</b>
        Калі ласка, зрабіце бота адміністратарам і паспрабуйце зноў.
    """,
    'instruction_added_message': """
        <b>Інструкцыя паспяхова дададзена.</b>
        - <i>Цяпер, калі Вы стварылі інструкцыю, у ёй можна стварыць катэгорыі для фільтрацыі карыстальнікаў.
        - Для гэтага выкарыстоўвайце: /add_category</i>
    """,
    'instruction_already_exists_message': """
        <b>Інструкцыя з такой назвай ужо існуе ў гэтым канале.</b>
        <i>Калі ласка, выкарыстоўвайце іншую назву.</i>
    """,
    'category_creating': """Інструкцыя ствараецца. Калі ласка, пачакайце...""",
    'invalid_group_id_message': """Прадастаўлены няправільны ID групы. Калі ласка, праверце і паспрабуйце зноў.""",
    'sent_name_instruction': """Адпраўце назву для вашай інструкцыі.""",
    'bot_not_in_chat_message': """
        <b>Бот не можа атрымаць доступ да інфармацыі аб удзельніку чата.</b>
        Пераканайцеся, што бот дададзены ў групу і паспрабуйце зноў.
    """,
    'instruction_added_error': """<b>Памылка пры стварэнні інструкцыі:</b> такая ўжо існуе.""",
    'inline_chat_selection': """
        Пацвердзіце Ваш выбар:
        
        - <b>Назва</b>: {group_name},
        - <b>ID</b>: {group_id}
    """,
    'no_rights_in_channel': """У бота няма правоў на поўнае рэдагаванне паведамленняў у абранай групе/канале.""",
    'your_channel_name': """Ваша назва:""",
    'code_404': """Каптча не прайдзена""",
    'code_404_description': """Перазапусціце функцыю, не мяняючы згенераваны код, каб убачыць свае вынікі.""",
    'switch_pm_text': """Выберыце групу/канал са спісу ніжэй""",
    'channel_approved': """Выбар пацверджаны!""",
    'category_name_too_long': """Назва катэгорыі занадта доўгая! (да 20 сімвалаў)""",
    'not_instruction_for_faq': """У вас няма інструкцый, да якіх можна дадаць FAQ.""",
    'not_categories_for_faq': """У вас няма катэгорый, да якіх можна дадаць FAQ.""",
    'choose_instruction_for_faq': """Выберыце інструкцыю, да якой вы жадаеце дадаць FAQ.""",
    'choose_category_for_faq': """Выберыце катэгорыю для FAQ.""",
    'enter_faq_name': """
        Увядзіце назву FAQ.
        <i>Гэтая назва будзе адлюстроўвацца ў посце спасылкамі інструкцый</i>
    """,
    'enter_faq_content': """Увядзіце змесціва FAQ (можа быць тэкстам або медыяфайлам).""",
    'faq_added_successfully': """Часта задаваныя пытанні паспяхова дададзены.""",
    'back_to_instruction': """Назад да інструкцый""",
    'navigation_error': """Памылка ў навігацыі па старонках.""",
    'micro_plan_faq': """
        <b>Прывітанне, вось мікраплан па цяперашнім кроку:</b>
        
        1. Выберыце інструкцыю для FAQ-поста.
        2. Выберыце катэгорыю ў інструкцыі.
        3. Увядзіце назву для FAQ-поста.
        4. Адпраўце змесціва FAQ-поста.
        5. Ваш FAQ-пост будзе дададзены і гатовы да публікацыі.
    """,
    'micro_plan_add_instruction': """
        Прывітанне, вось мікраплан па бягучаму этапе:
        
        1. Абярыце або дадайце канал/групу для бота.
        2. Дадайце бота як адміна ў абраны канал/групу.
        3. Пацвердзіце выбар канала/групы ў інлайн-рэжыме.
        4. Увядзіце назву інструкцыі.
        5. Завершыце працэс. Будзе адпраўленае апавяшчэнне, калі бот выдалены з канала/групы.
    """,
    'micro_plan_add_category': """
        <b>Прывітанне, вось мікраплан па бягучаму кроку:</b>
        
        1. Адпраўце каманду /add_category для пачатку працэсу.
        2. Абярыце інструкцыю, да якой будзе прывязана катэгорыя.
        3. Увядзіце назву катэгорыі (не больш за 20 сімвалаў).
        4. Укажыце двухлітарны код мовы катэгорыі (напрыклад, 'en' альбо 'ru').
        5. Пасля праверкі і пацверджання інфармацыі катэгорыя будзе дададзена.
    """,
    'not_instruction_for_publish': """<b>Няма інструкцый для публікацыі!</b>""",
    'micro_plan_publish': """
        <b>Прывітанне, вось мікраплан па цяперашнім кроку:</b>
        
        1. Абярыце інструкцыю для FAQ-поста.
        2. Абярыце катэгорыю ў інструкцыі.
        3. Абярыце тып публікацыі.
        4. Пасля праверкі і пацверджання ваша інструкцыя будзе апублікавана. Вы атрымаеце апавяшчэнне аб завяршэнні працэсу.
    """,
    'select_type_for_publish_pro': """
        <b>Выберыце тып публікацыі</b>
        <i>Вам даступныя ўсе віды публікацый</i>
    """,
    'select_type_for_publish_not_pro': """
        <b>Выберыце тып публікацыі</b>
        <i>Вы можаце апублікаваць толькі 1 старонку</i>
    """,
    '': """Please provide the text you need translated to Belarusian.""",
}
