fa = {
    'welcome_message': """
        🎉 به <b>Guidler</b> خوش آمدید! 🎉
        🚀 از اینکه به ما اعتماد دارید خوشحالیم 🥰.
        🙃 می‌خواهید با چه وضعیتی به ما بپیوندید؟
    """,
    'start_admin_message': """
        🔆 به ادمین در <b>Guidler</b> خوش آمدید! 🔆
        🚀 از اینکه به ما اعتماد دارید خوشحالیم 🥰.
    """,
    'start_message': """
        🔆 به <b>Guidler</b> بازگشتید! 🔆
        🚀 ما خوشحالیم که به ما اعتماد دارید 🥰.
    """,
    'choose_category': """دسته‌بندی را انتخاب کنید""",
    'choose_instruction': """دستورالعمل را انتخاب کنید""",
    'choose_channel_message': """کانال/گروه مورد نظر برای دستورالعمل خود را انتخاب کنید""",
    'sent_name_category': """<b>نام دسته را وارد کنید:</b>""",
    'sent_lang_category': """<b>زبان مورد نظر برای دسته‌بندی را به فرمت دو حرفی وارد کنید (مانند: ru, en, و غیره):</b>""",
    'category_crating': """<b>دسته‌بندی با موفقیت ایجاد شد.</b>""",
    'invalid_language_code': """کد زبان نامعتبر است. لطفاً یک کد دو حرفی صحیح وارد کنید.""",
    'help_message': """پس، این لیست دستورات است:""",
    'registration_required_message': """برای استفاده از این ویژگی، ثبت نام ضروری است.""",
    'bot_not_admin_message': """
        <b>ربات در این چت ادمین نیست.</b>
        لطفاً ربات را ادمین کنید و دوباره امتحان کنید.
    """,
    'instruction_added_message': """
        <b>دستورالعمل با موفقیت اضافه شد.</b>
        - <i>حالا که شما یک دستورالعمل ایجاد کرده‌اید، می‌توانید برای فیلتر کردن کاربران دسته‌بندی‌هایی در آن ایجاد کنید.
        - برای این کار از: /add_category استفاده کنید</i>
    """,
    'instruction_already_exists_message': """
        <b>دستورالعملی با این نام در این کانال از قبل وجود دارد.</b>
        <i>لطفا از نام دیگری استفاده کنید.</i>
    """,
    'category_creating': """دستورالعمل در حال ایجاد است. لطفا صبر کنید...""",
    'invalid_group_id_message': """
        <b>شناسه گروه ارائه شده نادرست است.</b>
        لطفاً بررسی کنید و دوباره تلاش کنید.
    """,
    'sent_name_instruction': """نامی برای دستورالعمل خود ارسال کنید.""",
    'bot_not_in_chat_message': """
        <b>ربات نمی‌تواند به اطلاعات عضو چت دسترسی پیدا کند.</b>
        اطمینان حاصل کنید که ربات به گروه اضافه شده است و دوباره تلاش کنید.
    """,
    'instruction_added_error': """<b>خطا در ایجاد دستورالعمل:</b> از قبل موجود است.""",
    'inline_chat_selection': """
        لطفاً انتخاب خود را تأیید کنید:
        
        - <b>نام</b>: {group_name},
        - <b>شناسه</b>: {group_id}
    """,
    'no_rights_in_channel': """بات دسترسی کامل برای ویرایش پیام‌ها در گروه/کانال انتخابی ندارد.""",
    'your_channel_name': """نام شما:""",
    'code_404': """کپچا پاس نشده است""",
    'code_404_description': """بدون تغییر کد تولید شده، تابع را دوباره راه اندازی کنید تا نتایج خود را ببینید.""",
    'switch_pm_text': """از لیست زیر گروه/کانالی را انتخاب کنید""",
    'channel_approved': """انتخاب تأیید شد!""",
    'category_name_too_long': """نام دسته بندی بسیار طولانی است! (تا ۲۰ کاراکتر)""",
    'not_instruction_for_faq': """شما دستورالعملی ندارید که بتوانید به آن FAQ اضافه کنید.""",
    'not_categories_for_faq': """شما هیچ دسته‌بندی برای افزودن سوالات متداول ندارید.""",
    'choose_instruction_for_faq': """دستورالعملی را که می‌خواهید به آن FAQ اضافه کنید، انتخاب کنید.""",
    'choose_category_for_faq': """دسته‌بندی مورد نظر برای سوالات متداول را انتخاب کنید.""",
    'enter_faq_name': """
        نام FAQ را وارد کنید.
        <i>این نام در پست به عنوان پیوندهای دستورالعمل نمایش داده می‌شود</i>
    """,
    'enter_faq_content': """لطفا محتوای سوالات متداول را وارد کنید (می‌تواند به صورت متن یا فایل رسانه‌ای باشد).""",
    'faq_added_successfully': """سوالات متداول با موفقیت افزوده شد.""",
    'back_to_instruction': """بازگشت به دستورالعمل‌ها""",
    'navigation_error': """خطا در ناوبری صفحات.""",
    'micro_plan_faq': """
        <b>سلام، این برنامه کوتاه برای مرحله فعلی است:</b>
        
        1. دستورالعملی را برای پست FAQ انتخاب کنید.
        2. دسته‌بندی مورد نظر در دستورالعمل را انتخاب کنید.
        3. نامی برای پست FAQ وارد کنید.
        4. محتوای پست FAQ را ارسال کنید.
        5. پست FAQ شما اضافه و آماده انتشار خواهد بود.
    """,
    'micro_plan_add_instruction': """
        <b>سلام، این یک برنامه کوتاه برای مرحله فعلی است:</b>
        
        ۱. یک کانال/گروه برای بات انتخاب کنید یا اضافه نمایید.
        ۲. بات را به عنوان یک ادمین در کانال/گروه انتخابی اضافه کنید.
        ۳. انتخاب کانال/گروه را در حالت اینلاین تایید کنید.
        ۴. نام دستورالعمل را وارد کنید.
        ۵. فرآیند را به پایان ببرید. اگر بات از کانال/گروه حذف شود، یک اعلان فرستاده خواهد شد.
    """,
    'micro_plan_add_category': """
        <b>سلام، در اینجا برنامه کوچکی برای مرحله فعلی است:</b>
        
        ۱. برای شروع فرآیند، دستور /add_category را ارسال کنید.
        ۲. دستورالعملی را که می‌خواهید دسته به آن متصل شود انتخاب کنید.
        ۳. نام دسته را وارد کنید (بیشتر از ۲۰ نویسه نباشد).
        ۴. کد دو حرفی زبان دسته را مشخص کنید (مثلاً 'en' یا 'ru').
        ۵. پس از بررسی و تایید اطلاعات، دسته اضافه خواهد شد.
    """,
    'not_instruction_for_publish': """دستورالعملی برای انتشار وجود ندارد!""",
    'micro_plan_publish': """
        <b>سلام، در اینجا برنامه‌ریزی کوچکی برای مرحله فعلی آورده شده است:</b>
        
        ۱. دستورالعملی برای پست FAQ انتخاب کنید.
        ۲. دسته‌بندی مربوط به دستورالعمل را انتخاب کنید.
        ۳. نوع انتشار را انتخاب کنید.
        ۴. پس از بررسی و تایید، دستورالعمل شما منتشر خواهد شد. شما اطلاعیه‌ای درباره اتمام فرآیند دریافت خواهید کرد.
    """,
    'select_type_for_publish_pro': """
        **نوع انتشار را انتخاب کنید**
        *تمام انواع انتشارات برای شما در دسترس است*
    """,
    'select_type_for_publish_not_pro': """
        <b>نوع انتشار را انتخاب کنید</b>
        <i>شما فقط می‌توانید 1 صفحه منتشر کنید</i>
    """,
    '': """
        Sure, I'd be happy to help! Please provide the text you need translated to Persian.
    """,
}
