kk = {
    'welcome_message': """
        🎉 <b>Guidler</b>қа қош келдіңіз! 🎉
        🚀 Сіз бізге сенім артқаныңызға қуаныштымыз 🥰.
        🙃 Бізге қандай мәртебеде қосылғыңыз келеді?
    """,
    'start_admin_message': """
        🔆 <b>Guidler</b>-ге қош келдіңіз, админ! 🔆
        🚀 Бізге сенім артқаныңызға қуаныштымыз 🥰.
    """,
    'start_message': """
        🔆 <b>Guidler</b>-ге қайта оралуыңызбен! 🔆
        🚀 Сіз бізге сенім артқаныңызға қуаныштымыз 🥰.
    """,
    'choose_category': """Санатты таңдаңыз""",
    'choose_instruction': """Нұсқаулықты таңдаңыз""",
    'choose_channel_message': """<b>Нұсқаулығыңыз үшін арна/топты таңдаңыз</b>""",
    'sent_name_category': """Санаттың атауын енгізіңіз:""",
    'sent_lang_category': """<b>Санат үшін екі әріпті форматта тілді енгізіңіз (ru, en т.б.):</b>""",
    'category_crating': """<b>Санат сәтті құрылды.</b>""",
    'invalid_language_code': """Тіл коды дұрыс емес. Өтінемін, дұрыс екі әріптен тұратын кодты енгізіңіз.""",
    'help_message': """<b>Ендеше, мына командалар тізімі:<b>""",
    'registration_required_message': """Бұл функцияны пайдалану үшін тіркелу қажет.""",
    'bot_not_admin_message': """
        <b>Бот бұл чатта әкімші емес.</b>
        Ботты әкімші етіп тағайындаңыз және қайтадан байқап көріңіз.
    """,
    'instruction_added_message': """
        <b>Нұсқаулық сәтті қосылды.</b>
        - <i>Енді сіз нұсқаулық құрған кезде - оны пайдаланушыларды сүзгілеу үшін санаттар жасауға болады.
        - Осы үшін пайдаланыңыз: /add_category</i>
    """,
    'instruction_already_exists_message': """
        <b>Осы атаумен нұсқаулық бұл арнада қазірдің өзінде бар.</b>
        <i>Өзге атауды пайдаланыңыз.</i>
    """,
    'category_creating': """Нұсқаулық жасалуда. Күте тұрыңыз...""",
    'invalid_group_id_message': """
        <b>Топтың дұрыс емес ID-сі берілді.</b>
        Өтінемін, тексеріп, қайталап көріңіз.
    """,
    'sent_name_instruction': """<b>Нұсқаулығыңыздың атауын жіберіңіз.</b>""",
    'bot_not_in_chat_message': """
        <b>Бот чат мүшесінің ақпаратына қол жеткізе алмайды.</b>
        Боттың топқа қосылғанын тексеріңіз және қайталап көріңіз.
    """,
    'instruction_added_error': """<b>Нұсқаулық жасау кезіндегі қате:</b> мұндай бұрыннан бар.""",
    'inline_chat_selection': """
        Растаңыз өз таңдауыңызды:
        
        - <b>Атауы</b>: {group_name},
        - <b>ID</b>: {group_id}
    """,
    'no_rights_in_channel': """Боттың таңдалған топ/арнада хабарламаларды толық өңдеуге құқықтары жоқ""",
    'your_channel_name': """Сіздің атауыңыз:""",
    'code_404': """Капча енгізілмеген""",
    'code_404_description': """Нәтижелеріңізді көру үшін, өндірілген кодты өзгертпей, функцияны қайта іске қосыңыз.""",
    'switch_pm_text': """Төмендегі тізімнен топ/арна таңдаңыз""",
    'channel_approved': """Таңдау расталды!""",
    'category_name_too_long': """Санат атауы тым ұзын! (20 таңбаға дейін)""",
    'not_instruction_for_faq': """Сізде FAQ қосуға болатын нұсқаулар жоқ.""",
    'not_categories_for_faq': """Сізде FAQ қосуға болатын санаттар жоқ.""",
    'choose_instruction_for_faq': """FAQ қосқыңыз келетін нұсқаулықты таңдаңыз.""",
    'choose_category_for_faq': """FAQ үшін санат таңдаңыз.""",
    'enter_faq_name': """
        FAQ атауын енгізіңіз.
        <i>Бұл атау нұсқаулық сілтемелері бар хабарламада көрінеді</i>
    """,
    'enter_faq_content': """FAQ мазмұнын енгізіңіз (мәтін немесе медиафайл болуы мүмкін).""",
    'faq_added_successfully': """FAQ сәтті қосылды.""",
    'back_to_instruction': """Нұсқауларға қайта""",
    'navigation_error': """Беттерді шарлаудағы қате.""",
    'micro_plan_faq': """
        <b>Сәлеметсіз бе, міне қазіргі қадам бойынша микрожоспар:</b>
        
        1. Жиі Қойылатын Сұрақтар посты үшін нұсқаулықты таңдаңыз.
        2. Нұсқаулықтағы санатты таңдаңыз.
        3. Жиі Қойылатын Сұрақтар постының атауын енгізіңіз.
        4. Жиі Қойылатын Сұрақтар постының мазмұнын жіберіңіз.
        5. Сіздің Жиі Қойылатын Сұрақтар постыңыз қосылып, жариялауға дайын болады.
    """,
    'micro_plan_add_instruction': """
        <b>Сәлеметсіз бе, міне қазіргі қадам бойынша микрожоспар:</b>
        
        1. Бот үшін арнаны/топты таңдаңыз немесе қосыңыз.
        2. Таңдалған арна/топта ботты админ ретінде қосыңыз.
        3. Арна/топтың таңдауын инлайн-режимде растаңыз.
        4. Нұсқаулықтың атауын енгізіңіз.
        5. Процессті аяқтаңыз. Егер бот арнадан/топтан алынып тасталса, хабарландыру жіберіледі.
    """,
    'micro_plan_add_category': """
        <b>Сәлеметсіз бе, ағымдағы қадам бойынша микрожоспар:</b>
        
        1. Процесті бастау үшін /add_category командасын жіберіңіз.
        2. Категория байланыстырылатын нұсқаулықты таңдаңыз.
        3. Категорияның атауын енгізіңіз (20 таңбадан аспауы тиіс).
        4. Категорияның тілінің екі әріптен тұратын кодын көрсетіңіз (мысалы, 'en' немесе 'ru').
        5. Ақпаратты тексеру мен растаудан кейін категория қосылады.
    """,
    'not_instruction_for_publish': """<b>Жариялау үшін нұсқаулық жоқ!</b>""",
    'micro_plan_publish': """
        <b>Сәлеметсіз бе, міне ағымдағы қадам бойынша микрожоспар:</b>
        
        1. FAQ-жазбасы үшін нұсқаулықты таңдаңыз.
        2. Нұсқаулықтағы санатты таңдаңыз.
        3. Жариялау түрін таңдаңыз.
        4. Тексеру мен растаудан кейін сіздің нұсқаулығыңыз жарияланады. Процестің аяқталғаны туралы хабарлама аласыз.
    """,
    'select_type_for_publish_pro': """
        <b>Жариялаудың түрін таңдаңыз</b>
        <i>Сізге барлық түрдегі жариялаулар қолжетімді</i>
    """,
    'select_type_for_publish_not_pro': """
        <b>Жариялау түрін таңдаңыз</b>
        <i>Сіз тек 1 бетті жариялай аласыз</i>
    """,
    '': """
        Please provide the text you'd like to have translated into Kazakh.
    """,
}
