uk = {
    'welcome_message': """
        🎉 Ласкаво просимо до <b>Guidler</b>! 🎉
        🚀 Ми раді, що Ви нам довіряєте 🥰.
        🙃 В якому статусі хочете приєднатися до нас?
    """,
    'start_admin_message': """
        🔆 Ласкаво просимо, адміне, до <b>Guidler</b>! 🔆
        🚀 Ми раді, що Ви нам довіряєте 🥰.
    """,
    'start_message': """
        🔆 З поверненням у <b>Guidler</b>! 🔆
        🚀 Ми раді, що Ви довіряєте нам 🥰.
    """,
    'choose_category': """Оберіть категорію""",
    'choose_instruction': """Оберіть інструкцію""",
    'choose_channel_message': """<b>Виберіть канал/групу для Вашої інструкції</b>""",
    'sent_name_category': """<b>Введіть назву категорії:</b>""",
    'sent_lang_category': """<b>Введіть мову для категорії у дволітерному форматі (ru, en тощо):</b>""",
    'category_crating': """<b>Категорія успішно створена.</b>""",
    'invalid_language_code': """Невірний код мови. Будь ласка, введіть коректний дволітерний код.""",
    'help_message': """Отже, ось список команд:""",
    'registration_required_message': """Для використання цієї функції необхідно зареєструватися.""",
    'bot_not_admin_message': """
        <b>Бот не є адміністратором у цьому чаті.</b>
        Будь ласка, зробіть бота адміністратором і спробуйте знову.
    """,
    'instruction_added_message': """
        <b>Інструкція успішно додана.</b>
        - <i>Тепер, коли Ви створили інструкцію, у ній можна створити категорії для фільтрації користувачів.
        - Для цього використовуйте: /add_category</i>
    """,
    'instruction_already_exists_message': """
        <b>Інструкція з такою назвою вже існує на цьому каналі.</b>
        <i>Будь ласка, використовуйте іншу назву.</i>
    """,
    'category_creating': """Інструкція створюється. Будь ласка, зачекайте...""",
    'invalid_group_id_message': """
        <b>Надано невірний ID групи.</b>
        Будь ласка, перевірте та спробуйте знову.
    """,
    'sent_name_instruction': """<b>Надішліть назву для вашої інструкції.</b>""",
    'bot_not_in_chat_message': """
        <b>Бот не може отримати доступ до інформації про учасника чату.</b>
        Переконайтеся, що бот доданий до групи і спробуйте знову.
    """,
    'instruction_added_error': """<b>Помилка при створенні інструкції:</b> така вже існує.""",
    'inline_chat_selection': """
        Підтвердіть Ваш вибір:
        
        - <b>Назва</b>: {group_name},
        - <b>ID</b>: {group_id}
    """,
    'no_rights_in_channel': """У бота немає прав на повне редагування повідомлень у вибраній групі/каналі.""",
    'your_channel_name': """Ваша назва:""",
    'code_404': """Капча не пройдена""",
    'code_404_description': """Перезапустіть функцію, не змінюючи згенерований код, щоб побачити свої результати.""",
    'switch_pm_text': """Оберіть групу/канал із списку ниже""",
    'channel_approved': """Вибір підтверджено!""",
    'category_name_too_long': """Назва категорії занадто довга! (до 20 символів)""",
    'not_instruction_for_faq': """У вас немає інструкцій, до яких можна додати FAQ.""",
    'not_categories_for_faq': """У вас немає категорій, до яких можна додати FAQ.""",
    'choose_instruction_for_faq': """Оберіть інструкцію, до якої ви хочете додати FAQ.""",
    'choose_category_for_faq': """Оберіть категорію для FAQ.""",
    'enter_faq_name': """
        Введіть назву FAQ.
        <i>Ця назва буде відображатись у пості як посилання на інструкції</i>
    """,
    'enter_faq_content': """Введіть вміст FAQ (може бути текстом або медіафайлом).""",
    'faq_added_successfully': """Часто задавані питання успішно додано.""",
    'back_to_instruction': """Назад до інструкцій""",
    'navigation_error': """Помилка в навігації по сторінках.""",
    'micro_plan_faq': """
        <b>Привіт, ось мікроплан за поточним кроком:</b>
        
        1. Виберіть інструкцію для FAQ-посту.
        2. Виберіть категорію в інструкції.
        3. Введіть назву для FAQ-посту.
        4. Надішліть вміст FAQ-посту.
        5. Ваш FAQ-пост буде доданий і готовий до публікації.
    """,
    'micro_plan_add_instruction': """
        <b>Привіт, ось мікроплан за поточним кроком:</b>
        
        1. Виберіть або додайте канал/групу для бота.
        2. Додайте бота як адміна у вибраний канал/групу.
        3. Підтвердіть вибір каналу/групи в інлайн-режимі.
        4. Введіть назву інструкції.
        5. Завершіть процес. Буде відправлено повідомлення, якщо бот видалений з каналу/групи.
    """,
    'micro_plan_add_category': """
        <b>Привіт, ось мікроплан за поточним кроком:</b>
        
        1. Надішліть команду /add_category для початку процесу.
        2. Виберіть інструкцію, до якої буде прив'язана категорія.
        3. Введіть назву категорії (не більше 20 символів).
        4. Вкажіть дволітерний код мови категорії (наприклад, 'en' або 'ru').
        5. Після перевірки та підтвердження інформації категорія буде додана.
    """,
    'not_instruction_for_publish': """<b>Немає інструкцій для публікації!</b>""",
    'micro_plan_publish': """
        <b>Привіт, ось мікроплан за поточним кроком:</b>
        
        1. Виберіть інструкцію для FAQ-поста.
        2. Виберіть категорію в інструкції.
        3. Виберіть тип публікації.
        4. Після перевірки та підтвердження ваша інструкція буде опублікована. Ви отримаєте повідомлення про завершення процесу.
    """,
    'select_type_for_publish_pro': """
        <b>Виберіть тип публікації</b>
        <i>Вам доступні всі види публікацій</i>
    """,
    'select_type_for_publish_not_pro': """
        <b>Виберіть тип публікації</b>
        <i>Ви можете опублікувати лише 1 сторінку</i>
    """,
    '': """Please provide the text you would like to have translated into Ukrainian.""",
}
